import java.util.ArrayList;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Test {
    public static void main(String[] args) {
        String str =  "\"衬\"<3257040@qq.com>;\"二木\"<6162345@qq.com>;\"三尺寒\"<4481762@qq.com>;" +
                "\"GOBG\"<7743817@qq.com>;\"还好啊。\"<8562803@qq.com>;\"逗你玩\"<9994044@qq.com>;\"Monica\"<16679695@qq" +
                ".com>;\"Zzzzzz\"<18490059@qq.com>;\"粉丝\"<20956493@qq.com>;\"@米斯特尔潘\"<21251607@qq.com>;" +
                "\"Eleven\"<21376181@qq.com>;\"小麋鹿\"<27649843@qq.com>;\"芳芳\"<29991636@qq.com>;\"陌路\"<33010531@qq" +
                ".com>;33402333@qq.com;\"42322070\"<42322070@qq.com>;\"&#x1F466;\"<44427278@qq.com>;\"黒\"<46058625@qq" +
                ".com>;\"⊙⊙?\"<47882330@qq.com>;\"忠哥\"<50815297@qq.com>;\"龍飛天\"<55103533@qq.com>;\"WY\"<57471334@qq" +
                ".com>;\"香草Дава\"<58054958@qq.com>;\"&#x273F;       T。~\"<58570447@qq.com>;\"小跃先玍\"<61812407@qq.com>;" +
                "\"禁斷の果實\"<75491800@qq.com>;\"84239628\"<84239628@qq.com>;\"JK\"<87154120@qq.com>;\"止步  " +
                "\\'\"<97660695@qq.com>;\"。\"<108487462@qq.com>;\"Palm\"<113281707@qq.com>;\"熊小泽\"<113444282@qq.com>;" +
                "\"其貌不阳\"<119200080@qq.com>;\"哈哈\"<120208106@qq.com>;\"玥含\"<121831253@qq.com>;\"Sherry\"<122572995@qq" +
                ".com>;\"深秋\"<123017064@qq.com>;\"大麦\"<123359621@qq.com>;\"chenchenchen\\'\"<123987632@qq.com>;" +
                "\"jessica\"<124913837@qq.com>;\"十七笔\"<125932523@qq.com>;\"&#x2764;  Au revoir\"<125998497@qq.com>;" +
                "\"06\"<136306233@qq.com>;\"奈斯\"<137172271@qq.com>;\"THE MONENT\"<154690376@qq.com>;\"Hello , Mr" +
                ".R\"<154871380@qq.com>;\"Lovewilber\"<157302970@qq.com>;\"怎么潇洒゛怎么活つ\"<164234979@qq.com>;" +
                "\"Lewy\"<171133755@qq.com>;\"Eric\"<173872808@qq.com>;\"▼ヤ小甁瓂\"<179921679@qq.com>;" +
                "\"雁过无痕\"<182262714@qq.com>;\"脆脆酥\"<183977175@qq.com>;\"lishuotracy\"<184695300@qq.com>;" +
                "\"沧浪之水\"<188459466@qq.com>;\"@木木---宋容\"<190746914@qq.com>;\"一匹马赛克\"<208882662@qq.com>;" +
                "\"不弃\"<210036651@qq.com>;\"。。。\"<214434873@qq.com>;\"沈青\"<215762230@qq.com>;\"依然\"<225501592@qq" +
                ".com>;\"红鲤鱼绿鲤鱼与驴\"<228216291@qq.com>;\"埖samaヽ\"<229839440@qq.com>;\"因你的回眸\"<237279951@qq.com>;" +
                "\"叶彬\"<243659203@qq.com>;\"战神子民\"<243976739@qq.com>;\"肥段\"<244578341@qq.com>;\"宝马豪\"<245957148@qq" +
                ".com>;\"ylovey\"<248466279@qq.com>;\"ready\"<248972107@qq.com>;\"精选﹌\"<249008588@qq.com>;" +
                "\"Michael\"<249993573@qq.com>;\"乔其纱。塔夫绸\"<251803550@qq.com>;\"岁月如歌\"<252401741@qq.com>;" +
                "\"Easy\"<258003192@qq.com>;\"again\"<260296986@qq.com>;\"One way\"<260127659@qq.com>;" +
                "\"刘毓赜\"<260447719@qq.com>;\"羽森\"<263985743@qq.com>;\"chen\"<267495470@qq.com>;\"★周星星★\"<272079448@qq" +
                ".com>;\"止于盛夏.\"<272222623@qq.com>;\"Miss四十四。\"<272887960@qq.com>;\"wyln\"<273194042@qq.com>;" +
                "\"Cat_猫儿妖（王倩\"<273540585@qq.com>;\"SHINee\"<273901202@qq.com>;\"Ace\"<274067936@qq.com>;" +
                "\"@阿颖-Eddie\"<274895799@qq.com>;\"Freeman\"<274918600@qq.com>;\"sweet heart\"<274967381@qq.com>;" +
                "\"遥、不可及\"<275051424@qq.com>;\"W&J\"<276109589@qq.com>;\"。\"<280093670@qq.com>;" +
                "\"love圆圆~胖轩\"<280257565@qq.com>;\"@建光分解\"<280259600@qq.com>;\"可乐\"<282278129@qq.com>;" +
                "\"@亮仔\"<282279139@qq.com>;\"子心\"<282449586@qq.com>;\"Momokoヾ\"<282583746@qq.com>;" +
                "\"摇摆在舞池中间ゝ\"<283053021@qq.com>;\"miumiu\"<283808875@qq.com>;\"瓶子盖\"<284928518@qq.com>;" +
                "\"朱琳\"<285517812@qq.com>;\"筱岳岳\"<286309842@qq.com>;\"一路有你\"<286735378@qq.com>;" +
                "\"Love圆圆~情殇\"<286891139@qq.com>;\"高圆圆粉\"<287033137@qq.com>;\"自我感\"<287385033@qq.com>;" +
                "\"中国鑫\"<287648987@qq.com>;\"love圆圆～涵涵\"<289276126@qq.com>;\"罗__特拉法尔加\"<290155233@qq.com>;" +
                "\"-hyzine\"<291705501@qq.com>;\"何营长の雪穗\"<292829752@qq.com>;\"糙苏，\"<294948158@qq.com>;" +
                "\"八路\"<294972764@qq.com>;\"男儿有累不轻谈\"<295039663@qq.com>;\"Zoe\"<295072929@qq.com>;\"&#x2744;&#xFE0F;" +
                "\"<295313940@qq.com>;\"37℃男人\uE231松\uE00E\"<295320315@qq.com>;\"笔戈\"<295523799@qq.com>;\"她&#xB4;" +
                "\"<295770874@qq.com>;\"＠固丽果弹棉花\"<295853298@qq.com>;\"王花花\"<297515313@qq.com>;\"天道\"<303026353@qq" +
                ".com>;\"小水滴\"<304065681@qq.com>;\"@IRENE_L天\"<304178666@qq.com>;\"彩云追月\"<305715468@qq.com>;" +
                "\"@ironeztt_se7en\"<305978767@qq.com>;\"没有资格@说什\"<307155193@qq.com>;\"Carol\"<310456150@qq.com>;" +
                "\"改个网名\"<312250428@qq.com>;\"说个笑话纪念我\"<313473442@qq.com>;\"梁教授\"<313635983@qq.com>;" +
                "\"@杨-Sao\"<313877408@qq.com>;\"&#xF8FF;\"<314088588@qq.com>;\"多多\"<314116613@qq.com>;" +
                "\"love圆圆~良总\"<314362988@qq.com>;\"小溱又瘦了\"<314601718@qq.com>;\"水果月饼\"<314921080@qq.com>;" +
                "\"疯子\"<316434672@qq.com>;\"一瞬间♂\"<317174114@qq.com>;\"碗小胖\"<317258201@qq.com>;\"Kevin&#x2620;" +
                "Wu\"<317355868@qq.com>;\"开到荼靡\"<317416775@qq.com>;\"祈典\"<317985054@qq.com>;" +
                "\"繁华世界的我们过于单纯\"<319479494@qq.com>;\"love圆圆~\"<321246773@qq.com>;\"哦.\"<326392558@qq.com>;" +
                "\"珊瑚\"<329659912@qq.com>;\"刘吖吖\"<330950682@qq.com>;\"往事……不堪回首\"<332777321@qq.com>;" +
                "\"Jasmine\"<335149254@qq.com>;\"长泽雅帅\"<337640858@qq.com>;\"&#xF04;&#xFC6;　&#xFC6;&#xFD0;杨&#xF04;" +
                "&#xFC6;　&#xFC6;&#xFD0;\"<343798734@qq.com>;\"水若有形\"<344262759@qq.com>;\"* 信 仰．／\"<344281158@qq.com>;" +
                "\"我行我秀\"<345539121@qq.com>;\"圆圆粉丝\"<346494248@qq.com>;\"@愉悦了余玥\"<349779974@qq.com>;" +
                "\"☆大拇指ザ\"<350028605@qq.com>;\"@高2O我的缪斯\"<350037771@qq.com>;\"一只幸运的小鹿\"<350753402@qq.com>;" +
                "\"Eudemonía\"<350936685@qq.com>;\"Zcc\\'\"<351992644@qq.com>;\"王宏伟\"<351593193@qq.com>;" +
                "\"@圆圆\"<353031443@qq.com>;353992107@qq.com;\"@闫并暖\"<354204353@qq.com>;\"z\"<354419910@qq.com>;" +
                "\"真爱这感觉\"<355229643@qq.com>;\"李\"<356540862@qq.com>;\"ζωééτ\"<359113782@qq.com>;\"无题\"<360645164@qq" +
                ".com>;\"麦芽糖\"<361391685@qq.com>;\"衬°\"<361736197@qq.com>;\"刘世忠\"<361984163@qq.com>;" +
                "\"Mocking\"<362344092@qq.com>;\"Andy lau丶落花\"<362531088@qq.com>;\"@飞祥@\"<364074696@qq.com>;" +
                "\"//////////\"<365188763@qq.com>;\"SoulMate\"<365339263@qq.com>;\"日出\"<365463930@qq.com>;" +
                "\"A-SE-2\"<370124564@qq.com>;\"眀眀\"<371160481@qq.com>;\"兔斯基Lara Croft\"<371174593@qq.com>;" +
                "\"ANLICE\"<371245399@qq.com>;\".    一米589小姐\"<371621518@qq.com>;\"Aaa\"<372321928@qq.com>;" +
                "\"就在你身边\"<372497638@qq.com>;\"陈撕掉\"<372691773@qq.com>;\"小黑。\"<372885656@qq.com>;\"趙&#x1F4AB;" +
                "\"<373275039@qq.com>;\"趙家汏sんао爺\"<375168532@qq.com>;\"莂嘸葰浗\"<376264080@qq.com>;\"Red\"<376281488@qq" +
                ".com>;\"Simmons\"<376486163@qq.com>;\"Cyndi辛迪韩式半永久定妆\"<378012853@qq.com>;\"八风不动\"<379448311@qq.com>;" +
                "\"一笑\"<379479427@qq.com>;\"额额嗯嗯\"<379609016@qq.com>;\"灵魂\"<379920568@qq.com>;" +
                "\"@高圆圆fans-妍\"<380781699@qq.com>;\"落大雨\"<381551145@qq.com>;\"17\"<382150067@qq.com>;\"Blue " +
                "snail\"<383475431@qq.com>;\"情话都是写给自己的。\"<383576389@qq.com>;\"清澈 .\"<384535313@qq.com>;" +
                "\"摩羯座的韩蜀黍\"<385718136@qq.com>;\"呀。\"<386217574@qq.com>;\"AMANDA\"<386342039@qq.com>;" +
                "\"等一个人，在浪之涯\"<386413033@qq.com>;\"时光旅人\"<386462043@qq.com>;\"唯情此生不换\"<389097354@qq.com>;" +
                "\"：）\"<389363667@qq.com>;\"EmoTion\"<389585637@qq.com>;\"AAAAAAAAA&#x1F4AD;\"<389704498@qq.com>;" +
                "\"光辉岁月\"<390400639@qq.com>;\"掌门跟班\"<391002341@qq.com>;\"樂樂,\"<391824586@qq.com>;" +
                "\"Veronica\"<392155296@qq.com>;\"love圆圆~康康\"<392934867@qq.com>;\"性子。\"<393629065@qq.com>;" +
                "\"高乐高\"<393787350@qq.com>;\"似水年华\"<394643858@qq.com>;\"@J-A-Ray\"<394704349@qq.com>;" +
                "\"ALLEn\"<395949201@qq.com>;\"396620665\"<396620665@qq.com>;\"姚小圈\"<396665201@qq.com>;\"&#x1F319;" +
                "\"<397505223@qq.com>;\"扬气喜喜、\"<398761295@qq.com>;\"一笑而过\"<401589926@qq.com>;\"藍\"<402285692@qq.com>;" +
                "\"平生欢\"<402333712@qq.com>;\"Warm gentle group\"<402610647@qq.com>;\"龙行天下\"<404043214@qq.com>;" +
                "\"Luke\"<405191865@qq.com>;\"I1ikeU\"<407162650@qq.com>;\"Jo\"<407518776@qq.com>;" +
                "\"姑娘坐在屋顶\"<408533362@qq.com>;\"Z z\"<408901059@qq.com>;\"等等林夕\"<410870546@qq.com>;" +
                "\"小贡\"<411043647@qq.com>;\"缪建平\"<411197763@qq.com>;\"ZZ\"<412119750@qq.com>;\"传超\"<412494550@qq" +
                ".com>;\"手可摘星辰 ♂\"<412530713@qq.com>;\"EASON.\"<413837136@qq.com>;\"Beckham\"<414639316@qq.com>;" +
                "\"有心没情\"<414717122@qq.com>;\"在 干嘛\"<415640752@qq.com>;\"嶉 睂\"<416098240@qq.com>;" +
                "\"高圆圆粉丝\"<416219765@qq.com>;\"父母用命孝\"<417590291@qq.com>;\"浅浅\"<417917826@qq.com>;\"ャo钕紸桷 " +
                "o\"<418492275@qq.com>;\"苹果橙汁-\"<418738186@qq.com>;\"伊  琳 。\"<419612962@qq.com>;" +
                "\"419868007\"<419868007@qq.com>;\"&#x2764; 夏美好°\"<419904088@qq.com>;\"優蕥の啭裑\"<420276340@qq.com>;" +
                "\"丰御生煎\"<420510387@qq.com>;\"方鹏 晴耕雨读 知行合一\"<420688179@qq.com>;\"渭水&泱泱\"<420693079@qq.com>;" +
                "\"高圆圆粉丝\"<421448694@qq.com>;\"有所思\"<422293533@qq.com>;\"执笔画浮尘，，\"<424733780@qq.com>;\"&#x1F48B; " +
                "落叶知秋\"<425121213@qq.com>;\"槿\"<429335505@qq.com>;\"高圆圆的粉丝\"<434906326@qq.com>;\"夜猫  .\"<435197625@qq" +
                ".com>;\"原点\"<437612993@qq.com>;\"我们的过去\"<437850207@qq.com>;\"青年晚报。\"<438706313@qq.com>;" +
                "\"我是面带微笑君\"<441286071@qq.com>;\"chillβoyz\"<441294432@qq.com>;\"哦\"<443421108@qq.com>;" +
                "\"天空\"<444279978@qq.com>;\"Yy.\"<445011771@qq.com>;\"Eunhye\"<445887919@qq.com>;" +
                "\"breathe\"<445123243@qq.com>;\"想容\"<448498799@qq.com>;\"穗Orange..\"<448762286@qq.com>;" +
                "\"J-Muse&#x2661;\"<449210130@qq.com>;\"心若移动～如何联通\"<449402981@qq.com>;\"寝潇潇\"<450168720@qq.com>;" +
                "\"凯旋而归\"<450579926@qq.com>;\"暖阳\"<450969790@qq.com>;\"&#x1F4A7;\"<450998280@qq.com>;\"偷影子的人&#x254;" +
                "&#x309B;\"<451483533@qq.com>;\"Young\"<452586030@qq.com>;\"正一\"<452667207@qq.com>;" +
                "\"Aries眼眸\"<452765358@qq.com>;\"涂着口红的沙皮狗\"<452947064@qq.com>;\"听说\"<453487783@qq.com>;" +
                "\"换。元\"<453544763@qq.com>;\"xx\"<453592101@qq.com>;\"万般皆是命\"<453643042@qq.com>;\"渡劫\"<454537403@qq" +
                ".com>;\"碎花旗袍i\"<454641701@qq.com>;\"訁\"<455105815@qq.com>;\"是轰轰呀\"<455594379@qq.com>;" +
                "\"永恒\"<457608897@qq.com>;\"love圆圆～瀚\"<457851352@qq.com>;\"&#x1F604;&#x1F604;\"<458583716@qq.com>;" +
                "\"先生顧\"<458889454@qq.com>;\"嘻嘻\"<459635951@qq.com>;\"流年\"<461640493@qq.com>;\"雨霖\"<463058882@qq" +
                ".com>;\"Real&#xA0;Madrid\"<465315261@qq.com>;\"___≮しIāňɡ≯\"<465341745@qq.com>;" +
                "\"love圆圆～yinhung\"<465774254@qq.com>;\"ZP\"<467200872@qq.com>;\"Y\"<467586258@qq.com>;" +
                "\"阿莎\"<470959329@qq.com>;\"&#x1F349;\"<471379863@qq.com>;\"物是人非\"<471469917@qq.com>;\"six " +
                "fly\"<472312654@qq.com>;\"施佳丽Scarlett\"<472391313@qq.com>;\"7\"<472428026@qq.com>;" +
                "\"wuli圆女神\"<473515473@qq.com>;\"Sunny\"<474241386@qq.com>;\"huhu\"<475227677@qq.com>;" +
                "\"TinkerBell&#x2665;\"<475393796@qq.com>;\"艺芯艺忆\"<476080227@qq.com>;\"『Excuse。』\"<476294331@qq.com>;" +
                "\"以梦为马\"<476626447@qq.com>;\"黄毓婷\"<476687168@qq.com>;\"zHAngyU\"<478296159@qq.com>;" +
                "\"478582876\"<478582876@qq.com>;\"OKay&#x1F463;\"<479318788@qq.com>;\"ims集团的媒介\"<490781824@qq.com>;" +
                "\"你是萌比妥妥的\"<491386889@qq.com>;\"蒲公英\"<492906264@qq.com>;\"。骗子、\"<492971821@qq.com>;" +
                "\"娃哈哈\"<493078071@qq.com>;\"向日葵不说心事。\"<493772052@qq.com>;\"静人静心”\"<494941654@qq.com>;" +
                "\"更黑\"<496750886@qq.com>;\"常干散\"<498352860@qq.com>;\"0.5+0.5=1\"<499877939@qq.com>;\"婷婷 " +
                "，\"<502857945@qq.com>;\"Chiara\"<502923743@qq.com>;\"503337554\"<503337554@qq.com>;" +
                "\"客服专员\"<503374024@qq.com>;\"hello\"<503397332@qq.com>;\"972。\"<503436528@qq.com>;" +
                "\"黎裳\"<504166761@qq.com>;\"C\"<504331778@qq.com>;\"庆功会你去吗？速\"<504484051@qq.com>;\"民 樂┌" +
                ".\"<505823230@qq.com>;\"&#x1F31A;\"<505933335@qq.com>;\"…\"<506609219@qq.com>;\"549\"<506989187@qq" +
                ".com>;\"The Count Strong Cold\"<508418430@qq.com>;\"密码子-!\"<510521653@qq.com>;\"乱七八糟\"<511294366@qq" +
                ".com>;\"陈曼迪\"<512108630@qq.com>;\"越来越好\"<513759558@qq.com>;\"joe.\"<514027413@qq.com>;" +
                "\"让未来的你感谢现在的你\"<515668808@qq.com>;\"胖霞\"<516015621@qq.com>;\"mickey\"<516601808@qq.com>;\"陌、 心 " +
                "&#x1F4A6;\"<516788513@qq.com>;\"love圆圆~Summer\"<516992692@qq.com>;\"露露\"<519408077@qq.com>;" +
                "\"噶\"<522040651@qq.com>;\"Monica\"<522263468@qq.com>;\"Uncle 6\"<522340171@qq.com>;" +
                "\"@real周文旭\"<523146309@qq.com>;\"圆圆粉丝\"<525430593@qq.com>;\"纵有千般爱恋\"<526076451@qq.com>;" +
                "\"memory\"<527002545@qq.com>;\"流星 划过的瞬间\"<527391247@qq.com>;\"拥友~\"<527624948@qq.com>;\"Happy ＆ " +
                "丫丫\"<527835542@qq.com>;\"YX.\"<529079450@qq.com>;\"Vintage L\"<529124788@qq.com>;\"狐狸&#x1F4AB;" +
                "fenny\"<529249259@qq.com>;\"じ誓言メ弑梦\"<530591137@qq.com>;\"Rose\"<530838405@qq.com>;" +
                "\"zooking\"<532364862@qq.com>;\"徐飘飘~\"<532962271@qq.com>;\"LEE\"<536328568@qq.com>;" +
                "\"相信\"<540479810@qq.com>;\"叮当深蓝\"<540482999@qq.com>;\"邹兵\"<542252652@qq.com>;\"小冯冯\"<543136142@qq" +
                ".com>;\"sue_hohohoho\"<543178510@qq.com>;\"心悦.\"<543424056@qq.com>;\"娜仁琪琪格\"<543793053@qq.com>;\"Mr" +
                ".Echo！\"<543969518@qq.com>;\"Sam.V\"<543992596@qq.com>;\"茉莉清茶\"<544297075@qq.com>;" +
                "\"卿矜子衿\"<544359618@qq.com>;\"&#x2764; Mind.Control\"<544412978@qq.com>;\"清大学习吧孙老师\"<544520766@qq" +
                ".com>;\"keep\"<545225326@qq.com>;\"Younger\"<545840456@qq.com>;\"老猫\"<546055741@qq.com>;" +
                "\"⑤丶⒈贰\"<546161821@qq.com>;\"韶华白首\"<546218401@qq.com>;\"Healer\"<546250018@qq.com>;\"Mr" +
                ".young\"<547313784@qq.com>;\"至爱至恨\"<547587456@qq.com>;\"love圆圆\"<549150550@qq.com>;" +
                "\"Amy她妈\"<549277626@qq.com>;\"芥子「*  玉子先生（Todd）\"<550110143@qq.com>;\"渔舟唱晚\"<550973756@qq.com>;" +
                "\"豆浆真逗\"<552070233@qq.com>;\"Muphrid\"<553926112@qq.com>;\"天山雪莲\"<554059736@qq.com>;" +
                "\"逝去的人\"<563482307@qq.com>;\"闵\"<564677381@qq.com>;\"就叫罗小黑吧\"<564421464@qq.com>;" +
                "\"前路漫漫。\"<565237358@qq.com>;\"郭建\"<565662567@qq.com>;\"4个冰河世纪\"<568695497@qq.com>;" +
                "\"梦里梦见梦外梦不见的梦\"<568989045@qq.com>;\"笑与卿歌\"<569385148@qq.com>;\"Martian\"<570120891@qq.com>;" +
                "\"陈舒婕\"<571299926@qq.com>;\"love圆圆~米饭\"<571661448@qq.com>;\"这个爷们不太瘦\"<571765136@qq.com>;" +
                "\"北陌深巷い\"<572726495@qq.com>;\"犹太\"<574358570@qq.com>;\"人間不值得.\"<574672934@qq.com>;\"&#x1F386;" +
                "\"<576026598@qq.com>;\"拥抱.\"<576355509@qq.com>;\"my best\"<576779316@qq.com>;\"I&#x1F49D;" +
                "柚\"<578972632@qq.com>;\"小饼\"<461257916@qq.com>;\"D。 k\"<582884110@qq.com>;\"维和\"<583004210@qq.com>;" +
                "\"◎玄天\"<584291868@qq.com>;\"萍子\"<584729309@qq.com>;\"Like a man is a man\"<591181430@qq.com>;" +
                "\"朱艳丽\"<591245409@qq.com>;\"ZOE慧\"<591279991@qq.com>;\"taurus\"<591478960@qq.com>;" +
                "\"Lana’thel\"<594050955@qq.com>;\"love圆圆～默默\"<594176538@qq.com>;\"ヾ.Steven 。\"<595422926@qq.com>;" +
                "\"在单行道上双向行走\"<596676437@qq.com>;\"赵拓拓\"<597695330@qq.com>;\"Nulia\"<597771656@qq.com>;" +
                "\"omtfo\"<598926794@qq.com>;\"-\"<599306799@qq.com>;\"Eugene\"<602151691@qq.com>;\"Yong-qiang " +
                "CAI\"<602283387@qq.com>;\"如刚洗过的白衬衫。\"<602811881@qq.com>;\"生活嘛就该这样\"<604108563@qq.com>;" +
                "\"shadow\"<605083584@qq.com>;\"蓝色\"<605370064@qq.com>;\"我還記得\"<610421287@qq.com>;" +
                "\"你是爱我的\"<616711168@qq.com>;\"雀儿\"<617409252@qq.com>;\"Green&#xBA;\"<619001653@qq.com>;" +
                "\"★饼饼★\"<617999960@qq.com>;\"一杯敬过往\"<623613009@qq.com>;\"love圆圆～果然@李\"<624096772@qq.com>;" +
                "\"明媚\"<624327751@qq.com>;\"大寒\"<624681080@qq.com>;\"风之王者\"<625284003@qq.com>;\"&#x1F41F;" +
                "\"<626374991@qq.com>;\"拢乎你\"<626916390@qq.com>;\"柠檬&#x1F34B;酸酸\"<627738204@qq.com>;\"IJ" +
                ".Xuan\"<631561782@qq.com>;\"张钰\"<632212332@qq.com>;\"★聪★--婞諨\"<632522559@qq.com>;" +
                "\"岁月漫漫\"<634035235@qq.com>;\"Achie-huhu\"<634281922@qq.com>;\"张思齐\"<634497661@qq.com>;" +
                "\"阡陌\"<634842073@qq.com>;\"IX\"<635640452@qq.com>;\"锦江之星\"<635995565@qq.com>;\"曾甜\"<639002142@qq" +
                ".com>;\"&#x1F451;\"<640576990@qq.com>;\"盛夏的猎户座℃\"<644528598@qq.com>;\"Varick．\"<645282190@qq.com>;" +
                "\"666\"<645761111@qq.com>;\"明眸\"<645832232@qq.com>;\"@忻芯昕-TerryLee\"<646302279@qq.com>;" +
                "\"大脸妹。\"<648067043@qq.com>;\"&#x1F644;\"<648242060@qq.com>;\"-茨尕蒾寶\"<648281065@qq.com>;" +
                "\"瑜\"<648782990@qq.com>;\"齊丶\"<649997147@qq.com>;\"Judy\"<651574435@qq.com>;";
        Pattern p = Pattern.compile("(<[^>]*>)");
        Matcher m = p.matcher(str);
        List<String> result=new ArrayList<>();
        while(m.find()){
            System.out.println(m.group().replace("<","").replace(">",""));
            result.add(m.group().replace("<","").replace(">",""));
        }
    }
}
